/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main_03.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: soohykim <soohykim@student.42seoul.>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/19 16:04:18 by soohykim          #+#    #+#             */
/*   Updated: 2023/01/26 02:05:00 by soohykim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	ft_atoi(char *str);

int	main(void)
{
	printf("\n%d :       ---+--+1234ab567을 넣었을 때\n", ft_atoi("      ---+--+1234--ab567"));
	printf("\n%d : exercise (문자열)를 넣었을 때\n", ft_atoi("exercise"));
}
